# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for pandas 1.4.3

In [1]:
import numpy as np
import pandas as pd

# Object creation

In [2]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [3]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [4]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range('20220619', periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [5]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-06-19  0.210498  0.578897  0.622327  0.642677
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-23  0.461732  0.228146 -2.324920 -0.489126
2022-06-24  0.443419  0.204478  1.078447 -0.901810
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831
2022-06-26 -0.393463  0.233569  0.170043  0.387859
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145
2022-06-28 -0.589475  1.006433  0.289863 -1.182770

In [6]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3]*6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo"
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [7]:
# the datatype of each of the columns would be different
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

# Viewing Data

In [8]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19  0.210498  0.578897  0.622327  0.642677
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-23  0.461732  0.228146 -2.324920 -0.489126

In [9]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26 -0.393463  0.233569  0.170043  0.387859
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145
2022-06-28 -0.589475  1.006433  0.289863 -1.182770

In [10]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
df.to_numpy()

array([[ 0.21049823,  0.57889674,  0.62232702,  0.64267716],
       [ 0.83533468,  1.11827702,  0.88098957, -1.30097378],
       [-0.21439965, -0.09826729, -0.89569706, -0.10412567],
       [ 0.5804761 ,  0.55783731, -0.68500707, -0.29091729],
       [ 0.46173193,  0.22814632, -2.32492039, -0.48912551],
       [ 0.4434194 ,  0.20447794,  1.07844677, -0.90181029],
       [-1.12062588, -0.42814844, -0.35094294,  0.29783057],
       [-0.39346263,  0.23356876,  0.17004292,  0.38785906],
       [-0.78211347, -1.15074284, -0.7466771 ,  0.64214488],
       [-0.58947471,  1.0064335 ,  0.28986306, -1.18276968]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [14]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.056862   0.225048  -0.196158  -0.229921
std     0.655938   0.672382   1.022638   0.728419
min    -1.120626  -1.150743  -2.324920  -1.300974
25%    -0.540472  -0.022581  -0.731260  -0.798639
50%    -0.001951   0.230858  -0.090450  -0.197521
75%     0.457154   0.573632   0.539211   0.365352
max     0.835335   1.118277   1.078447   0.642677

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [15]:
# change the percentiles
df.describe(percentiles=[.1, .5, .9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.056862   0.225048  -0.196158  -0.229921
std     0.655938   0.672382   1.022638   0.728419
min    -1.120626  -1.150743  -2.324920  -1.300974
10%    -0.815965  -0.500408  -1.038619  -1.194590
50%    -0.001951   0.230858  -0.090450  -0.197521
90%     0.605962   1.017618   0.900735   0.642198
max     0.835335   1.118277   1.078447   0.642677

In [16]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A    C    D
count  6.0  6.0  6.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [17]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,0.210498,0.835335,-0.214400,0.580476,0.461732,0.443419,-1.120626,-0.393463,-0.782113,-0.589475
B,0.578897,1.118277,-0.098267,0.557837,0.228146,0.204478,-0.428148,0.233569,-1.150743,1.006433
C,0.622327,0.880990,-0.895697,-0.685007,-2.324920,1.078447,-0.350943,0.170043,-0.746677,0.289863
D,0.642677,-1.300974,-0.104126,-0.290917,-0.489126,-0.901810,0.297831,0.387859,0.642145,-1.182770

In [18]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19  0.642677  0.622327  0.578897  0.210498
2022-06-20 -1.300974  0.880990  1.118277  0.835335
2022-06-21 -0.104126 -0.895697 -0.098267 -0.214400
2022-06-22 -0.290917 -0.685007  0.557837  0.580476
2022-06-23 -0.489126 -2.324920  0.228146  0.461732
2022-06-24 -0.901810  1.078447  0.204478  0.443419
2022-06-25  0.297831 -0.350943 -0.428148 -1.120626
2022-06-26  0.387859  0.170043  0.233569 -0.393463
2022-06-27  0.642145 -0.746677 -1.150743 -0.782113
2022-06-28 -1.182770  0.289863  1.006433 -0.589475

In [19]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28 -0.589475  1.006433  0.289863 -1.182770
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145
2022-06-26 -0.393463  0.233569  0.170043  0.387859
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831
2022-06-24  0.443419  0.204478  1.078447 -0.901810
2022-06-23  0.461732  0.228146 -2.324920 -0.489126
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-19  0.210498  0.578897  0.622327  0.642677

In [20]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145
2022-06-28 -0.589475  1.006433  0.289863 -1.182770
2022-06-26 -0.393463  0.233569  0.170043  0.387859
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126
2022-06-19  0.210498  0.578897  0.622327  0.642677
2022-06-24  0.443419  0.204478  1.078447 -0.901810
2022-06-23  0.461732  0.228146 -2.324920 -0.489126
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-20  0.835335  1.118277  0.880990 -1.300974

In [21]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [22]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [23]:
# selecting a single column returns a Series object
df["A"]

2022-06-19    0.210498
2022-06-20    0.835335
2022-06-21   -0.214400
2022-06-22    0.580476
2022-06-23    0.461732
2022-06-24    0.443419
2022-06-25   -1.120626
2022-06-26   -0.393463
2022-06-27   -0.782113
2022-06-28   -0.589475
Freq: D, Name: A, dtype: float64

In [24]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-23  0.461732  0.228146 -2.324920 -0.489126

## Selection by label

In [25]:
# selecting based on a label
df.loc[dates[0]]

A    0.210498
B    0.578897
C    0.622327
D    0.642677
Name: 2022-06-19 00:00:00, dtype: float64

In [26]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19  0.210498  0.578897
2022-06-20  0.835335  1.118277
2022-06-21 -0.214400 -0.098267
2022-06-22  0.580476  0.557837
2022-06-23  0.461732  0.228146
2022-06-24  0.443419  0.204478
2022-06-25 -1.120626 -0.428148
2022-06-26 -0.393463  0.233569
2022-06-27 -0.782113 -1.150743
2022-06-28 -0.589475  1.006433

In [27]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A    0.835335
B    1.118277
C    0.880990
D   -1.300974
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [28]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

0.21049823456231306

In [29]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

0.21049823456231306

## Selection by position

In [30]:
df.iloc[2]

A   -0.214400
B   -0.098267
C   -0.895697
D   -0.104126
Name: 2022-06-21 00:00:00, dtype: float64

In [31]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20  0.835335  1.118277
2022-06-21 -0.214400 -0.098267
2022-06-22  0.580476  0.557837
2022-06-23  0.461732  0.228146

In [32]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19  0.210498  0.622327
2022-06-20  0.835335  0.880990
2022-06-21 -0.214400 -0.895697
2022-06-25 -1.120626 -0.350943

In [33]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19  0.622327  0.578897  0.210498  0.622327
2022-06-20  0.880990  1.118277  0.835335  0.880990
2022-06-21 -0.895697 -0.098267 -0.214400 -0.895697
2022-06-25 -0.350943 -0.428148 -1.120626 -0.350943

In [34]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126

In [35]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19  0.622327  0.642677
2022-06-20  0.880990 -1.300974
2022-06-21 -0.895697 -0.104126
2022-06-22 -0.685007 -0.290917
2022-06-23 -2.324920 -0.489126
2022-06-24  1.078447 -0.901810
2022-06-25 -0.350943  0.297831
2022-06-26  0.170043  0.387859
2022-06-27 -0.746677  0.642145
2022-06-28  0.289863 -1.182770

In [36]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19  0.210498  0.578897  0.622327  0.642677
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-23  0.461732  0.228146 -2.324920 -0.489126
2022-06-24  0.443419  0.204478  1.078447 -0.901810
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831
2022-06-26 -0.393463  0.233569  0.170043  0.387859
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145
2022-06-28 -0.589475  1.006433  0.289863 -1.182770

In [37]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

0.8809895680104617

In [38]:
#
# method two: use iat
df.iat[1, 2]

0.8809895680104617

## Boolean Indexing

In [39]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-19  0.210498  0.578897  0.622327  0.642677
2022-06-20  0.835335  1.118277  0.880990 -1.300974
2022-06-22  0.580476  0.557837 -0.685007 -0.290917
2022-06-23  0.461732  0.228146 -2.324920 -0.489126
2022-06-24  0.443419  0.204478  1.078447 -0.901810

In [40]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19  0.210498  0.578897  0.622327  0.642677
2022-06-20  0.835335  1.118277  0.880990       NaN
2022-06-21       NaN       NaN       NaN       NaN
2022-06-22  0.580476  0.557837       NaN       NaN
2022-06-23  0.461732  0.228146       NaN       NaN
2022-06-24  0.443419  0.204478  1.078447       NaN
2022-06-25       NaN       NaN       NaN  0.297831
2022-06-26       NaN  0.233569  0.170043  0.387859
2022-06-27       NaN       NaN       NaN  0.642145
2022-06-28       NaN  1.006433  0.289863       NaN

In [41]:
# add another column
df11 = df.copy()
df11["E"] = ["one", "two", "three", "four",
             "two", "five", "one", "two", "three", "four"]
df11

                   A         B         C         D      E
2022-06-19  0.210498  0.578897  0.622327  0.642677    one
2022-06-20  0.835335  1.118277  0.880990 -1.300974    two
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  three
2022-06-22  0.580476  0.557837 -0.685007 -0.290917   four
2022-06-23  0.461732  0.228146 -2.324920 -0.489126    two
2022-06-24  0.443419  0.204478  1.078447 -0.901810   five
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831    one
2022-06-26 -0.393463  0.233569  0.170043  0.387859    two
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145  three
2022-06-28 -0.589475  1.006433  0.289863 -1.182770   four

In [42]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20  0.835335  1.118277  0.880990 -1.300974   two
2022-06-23  0.461732  0.228146 -2.324920 -0.489126   two
2022-06-24  0.443419  0.204478  1.078447 -0.901810  five
2022-06-26 -0.393463  0.233569  0.170043  0.387859   two

## Setting values

In [43]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range('20220619', periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [44]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19  0.210498  0.578897  0.622327  0.642677  11
2022-06-20  0.835335  1.118277  0.880990 -1.300974  12
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14
2022-06-23  0.461732  0.228146 -2.324920 -0.489126  15
2022-06-24  0.443419  0.204478  1.078447 -0.901810  16
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831  17
2022-06-26 -0.393463  0.233569  0.170043  0.387859  18
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145  19
2022-06-28 -0.589475  1.006433  0.289863 -1.182770  20

In [45]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19  0.210498  0.578897  0.622327  0.642677  11
2022-06-20  0.835335  1.118277  0.880990 -1.300974  12
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14
2022-06-23  0.461732  0.228146 -2.324920 -0.489126  15
2022-06-24  0.443419  0.204478  1.078447 -0.901810  16
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831  17
2022-06-26 -0.393463  0.233569  0.170043  0.387859  18
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145  19
2022-06-28 -0.589475  1.006433  0.289863 -1.182770  20

In [46]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000  0.622327  0.642677  11
2022-06-20  0.835335  1.118277  0.880990 -1.300974  12
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14
2022-06-23  0.461732  0.228146 -2.324920 -0.489126  15
2022-06-24  0.443419  0.204478  1.078447 -0.901810  16
2022-06-25 -1.120626 -0.428148 -0.350943  0.297831  17
2022-06-26 -0.393463  0.233569  0.170043  0.387859  18
2022-06-27 -0.782113 -1.150743 -0.746677  0.642145  19
2022-06-28 -0.589475  1.006433  0.289863 -1.182770  20

In [47]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5]*len(df))
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000  0.622327  5  11
2022-06-20  0.835335  1.118277  0.880990  5  12
2022-06-21 -0.214400 -0.098267 -0.895697  5  13
2022-06-22  0.580476  0.557837 -0.685007  5  14
2022-06-23  0.461732  0.228146 -2.324920  5  15
2022-06-24  0.443419  0.204478  1.078447  5  16
2022-06-25 -1.120626 -0.428148 -0.350943  5  17
2022-06-26 -0.393463  0.233569  0.170043  5  18
2022-06-27 -0.782113 -1.150743 -0.746677  5  19
2022-06-28 -0.589475  1.006433  0.289863  5  20

In [48]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000 -0.622327 -5 -11
2022-06-20 -0.835335 -1.118277 -0.880990 -5 -12
2022-06-21 -0.214400 -0.098267 -0.895697 -5 -13
2022-06-22 -0.580476 -0.557837 -0.685007 -5 -14
2022-06-23 -0.461732 -0.228146 -2.324920 -5 -15
2022-06-24 -0.443419 -0.204478 -1.078447 -5 -16
2022-06-25 -1.120626 -0.428148 -0.350943 -5 -17
2022-06-26 -0.393463 -0.233569 -0.170043 -5 -18
2022-06-27 -0.782113 -1.150743 -0.746677 -5 -19
2022-06-28 -0.589475 -1.006433 -0.289863 -5 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [49]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns)+["G"])
df13

                   A         B         C         D   F   G
2022-06-19  0.210498  0.578897  0.622327  0.642677  11 NaN
2022-06-20  0.835335  1.118277  0.880990 -1.300974  12 NaN
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13 NaN
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [50]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                   A         B         C         D   F    G
2022-06-19  0.210498  0.578897  0.622327  0.642677  11  NaN
2022-06-20       NaN  1.118277  0.880990 -1.300974  12  0.0
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13  0.0
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14  0.0

In [51]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [52]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [53]:
# the original is still there
df13

                   A         B         C         D   F    G
2022-06-19  0.210498  0.578897  0.622327  0.642677  11  NaN
2022-06-20       NaN  1.118277  0.880990 -1.300974  12  0.0
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13  0.0
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14  0.0

In [54]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                   A         B         C         D   F    G
2022-06-19  0.210498  0.578897  0.622327  0.642677  11  NaN
2022-06-20       NaN  1.118277  0.880990 -1.300974  12  0.0
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13  0.0
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14  0.0

In [55]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=any : If any NA values are present, drop that row or column.
# how=all : If all values are NA, drop that row or column.

In [56]:
# all rows/cols with missing data stripped
df_no_na

                   A         B         C         D   F    G
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13  0.0
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14  0.0

In [57]:
# original still intact
df132

                   A         B         C         D   F    G
2022-06-19  0.210498  0.578897  0.622327  0.642677  11  NaN
2022-06-20       NaN  1.118277  0.880990 -1.300974  12  0.0
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13  0.0
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14  0.0

In [58]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                   A         B         C         D   F    G
2022-06-21 -0.214400 -0.098267 -0.895697 -0.104126  13  0.0
2022-06-22  0.580476  0.557837 -0.685007 -0.290917  14  0.0

In [59]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi*1000)

                      A         B         C         D   F            G
2022-06-19     0.210498  0.578897  0.622327  0.642677  11  3141.592654
2022-06-20  3141.592654  1.118277  0.880990 -1.300974  12     0.000000
2022-06-21    -0.214400 -0.098267 -0.895697 -0.104126  13     0.000000
2022-06-22     0.580476  0.557837 -0.685007 -0.290917  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...

## Create two datasets with _mismatched_ indexes

In [67]:
# date range indexes
idx1 = pd.date_range('2022-01-01',periods = 10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range('2022-01-03',periods = 10)

In [61]:
# dataframes from indexes
d1 = pd.DataFrame(index = idx1, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

d2 = pd.DataFrame(index = idx2, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

In [62]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html 
d1_styler = d1.style.set_table_attributes("style='display:inline'")
d2_styler = d2.style.set_table_attributes("style='display:inline'")
display_html(d1_styler._repr_html_()+d2_styler._repr_html_(), raw=True)

,A,B
2022-01-01 00:00:00,0.613937,16
2022-01-02 00:00:00,0.597496,5
2022-01-03 00:00:00,0.218380,8
2022-01-04 00:00:00,0.764205,3
2022-01-05 00:00:00,0.231822,1
2022-01-06 00:00:00,0.251753,7
2022-01-07 00:00:00,0.723551,23
2022-01-08 00:00:00,0.382870,16
2022-01-09 00:00:00,0.306592,20
2022-01-10 00:00:00,0.354008,12
,A,B
2022-01-03 00:00:00,0.572905,2
2022-01-04 00:00:00,0.174980,17
2022-01-05 00:00:00,0.811982,9
2022-01-06 00:00:00,0.611470,5
2022-01-07 00:00:00,0.289400,21
2022-01-08 00:00:00,0.775213,19
2022-01-09 00:00:00,0.663113,3
2022-01-10 00:00:00,0.536575,7
2022-01-11 00:00:00,0.902614,10
2022-01-12 00:00:00,0.519029,19

The above trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

In [63]:
# the + operation is UNION of indexes
d3 = d1+d2
# indexs not present in the other dataframe get a NaN
d3.style.highlight_null(null_color='red')

In [64]:
# do you can obvs remove nan values like before
# the + operation is UNION of indexes
d31 = (d1+d2).dropna()
# indexs not present in the other dataframe get a NaN
d3.style.highlight_null(null_color='red')

# Operations on data

## Stats

Operations in general exclude missing data

In [65]:
# arithmetic mean, for each column (axis = 0)
df.mean()

A    -0.056862
B     0.225048
C    -0.196158
D    -0.229921
F    15.500000
dtype: float64

In [66]:
# mean across a row (axis = 1)
df.mean(1)

2022-06-19    2.610880
2022-06-20    2.706725
2022-06-21    2.337502
2022-06-22    2.832478
2022-06-23    2.575166
2022-06-24    3.364907
2022-06-25    3.079623
2022-06-26    3.679602
2022-06-27    3.392522
2022-06-28    3.904810
Freq: D, dtype: float64